GHP-63-ECE/ARCS/ARCS-ESP32/src/main.cpp
    pidControllerExt.UpdateError(error);
    double output = pidControllerExt.TotalError();
    Serial.print(" Extruder PID Output: ");
    Serial.print(output);

    int speed = atTarget ? 0 : pidOutputToSpeed(output, error, maxSpeed);
    setGantryPower(speed);
    Serial.print(" Extruder Speed: ");
    Serial.println(speed);
    delay(movementLoopDelayMs);
  }
}

// MARK: Encoder Updates

void updateEncoderLeft(){
  if (digitalRead(ENCAFL) > digitalRead(ENCBFL))
    encoderValueLeft--;
  else
    encoderValueLeft++;
}

void updateEncoderRight(){
  if (digitalRead(ENCAFR) > digitalRead(ENCBFR))
    encoderValueRight++;
  else
    encoderValueRight--;
}

void updateEncoderGantry(){
  if (digitalRead(ENCGANA) > digitalRead(ENCGANB))
    encoderValueGantry++;
  else
    encoderValueGantry--;
}

void updateEncoderExtruder(){
  if(digitalRead(ENCEXTA) > digitalRead(ENCEXTB)){
    encoderValueExtruder++;
  } else{
    encoderValueExtruder--;
  }
}

int readEncoderExtruder(){
  return encoderValueExtruder;
}

bool followPath(float ax[], float ay[]){
  bool proceed = false;
  for(int i = 4; i >= 0; i--){
    if(ax[i] == -1 && ay[i] == -1){
      Serial.println("No crack Detected");
      return false;
    }

    if(i != 4){
      float aax[5];
      float aay[5];
      aax[i] = ax[i] + (0.5-ax[i+1]);
      aay[i] = ay[i] + (0.5-ay[i+1]);
      Serial.println("AX: " + String(aax[i]));
      Serial.println("AY: " + String(aay[i]));
      driveToCrackCenterNoRot(aax[i], aay[i]);
    } else{
    driveToCrackCenterNoRot(ax[i], ay[i]);
    }
    // gantryAlign(ax[i]);
  }
  return true;
}

bool crackAuto() {
  while(true) {
    if(cx == -1 && cy == -1) {
      Serial.println("No Crack Detected");
      return false;
    }
    if(isDriveAligned()) {
      Serial.println("Drive aligned with crack center");
      if(isAtTargetPositionGantry()) {
        // TODO: Add extrusion
        return true;
      } else {
        while (!isAtTargetPositionGantry()) {
          gantryAlign(cx);
        }
        return true;
      }
    }
    
    else {
      int dCX = cx;
      int dCY = cy;
      while(!isDriveAligned){
        driveToCrackCenter(dCX, dCY);
      }
    }
    return false;
  }
}

bool testAutoDrive() {
    int dCX = cx;
      int dCY = cy;
      while(true){
        driveToCrackCenter(dCX, dCY);
      }
      Serial.println("Aligned");
    return true;
}

void updateVision(){
  if (BS.available() > 0) {
    String rawData = BS.readStringUntil('\n');
    rawData.trim();
    if (rawData.length() > 0) {
      int cxIndex = rawData.indexOf("cx");
      int cyIndex = rawData.indexOf("cy");
      int xIndex = rawData.indexOf("x1");
      String xData = rawData.substring(cxIndex + 4, cyIndex - cxIndex - 3);
      String yData = rawData.substring(cyIndex + 4, xIndex - cyIndex - 3);
      cx = xData.toFloat();
      cy = yData.toFloat();
    Serial.println(rawData);
    }
  }
}

void updateVisionArray(){
  if (BS.available() > 0){
    String rawData = BS.readStringUntil('\n');
    rawData.trim();
    if(rawData.length() > 0){
      int x1Index = rawData.indexOf("x1");
      int x2Index = rawData.indexOf("x2");
      int x3Index = rawData.indexOf("x3");
      int x4Index = rawData.indexOf("x4");
      int cxIndex = rawData.indexOf("cx");

      int y1Index = rawData.indexOf("y1");
      int y2Index = rawData.indexOf("y2");
      int y3Index = rawData.indexOf("y3");
      int y4Index = rawData.indexOf("y4");
      int cyIndex = rawData.indexOf("cy");
      
      String x1Data = rawData.substring(x1Index + 4, x2Index - x1Index - 3);
      String x2Data = rawData.substring(x2Index + 4, x3Index - x2Index - 3);
      String x3Data = rawData.substring(x3Index + 4, x4Index - x3Index - 3);
      String x4Data = rawData.substring(x4Index + 4, cxIndex - x4Index - 3);
      String cxData = rawData.substring(cxIndex + 4, cyIndex - cxIndex - 3);

      String y1Data = rawData.substring(cyIndex + 4, cxIndex - cyIndex - 3);
      String y2Data = rawData.substring(y1Index + 4, y2Index - y1Index - 3);
      String y3Data = rawData.substring(y2Index + 4, y3Index - y2Index - 3);
      String y4Data = rawData.substring(y3Index + 4, y4Index - y3Index - 3);
      String cyData = rawData.substring(y4Index + 4, y3Index - y4Index - 3);
      
      ax[0] = cxData.toFloat();
      ax[1] = x1Data.toFloat();
      ax[2] = x2Data.toFloat();
      ax[3] = x3Data.toFloat();
      ax[4] = x4Data.toFloat();

      ay[0] = y1Data.toFloat();
      ay[1] = y2Data.toFloat();
      ay[2] = y3Data.toFloat();
      ay[3]= y4Data.toFloat();
      ay[4] = y4Data.toFloat();
    }
  }
}

// MARK: Setup
void setup() {

  Serial.begin(115200);
  BS.begin("ARCS");

  // Set all control pins to outputs
  pinMode(PWML, OUTPUT);
  pinMode(L1, OUTPUT);
  pinMode(L2, OUTPUT);
  pinMode(PWMR, OUTPUT);
  pinMode(R1, OUTPUT);
  pinMode(R2, OUTPUT);
  pinMode(Gantry1, OUTPUT);
  pinMode(Gantry2, OUTPUT);
  pinMode(ENI, OUTPUT);
  pinMode(PWM_EXT, OUTPUT);
  pinMode(EXT1, OUTPUT);
  pinMode(EXT2, OUTPUT);

  // Set all encoder pins to inputs
  pinMode(ENCAFL, INPUT);
  pinMode(ENCBFL, INPUT);
  pinMode(ENCAFR, INPUT);
  pinMode(ENCBFR, INPUT);
  pinMode(ENCGANA, INPUT);
  pinMode(ENCGANB, INPUT);
  pinMode(ENCEXTA, INPUT);
  pinMode(ENCEXTB, INPUT);

  // Set encoder pins to interrupts
  attachInterrupt(digitalPinToInterrupt(ENCAFL), updateEncoderLeft, RISING);

  attachInterrupt(digitalPinToInterrupt(ENCAFR), updateEncoderRight, RISING);

  attachInterrupt(digitalPinToInterrupt(ENCGANA), updateEncoderGantry, RISING);

  attachInterrupt(digitalPinToInterrupt(ENCEXTA), updateEncoderGantry, RISING);
  
  servo.attach(servoPin);
  servo.writeMicroseconds(1100); // send "stop" signal to ESC. Also necessary to arm the ESC.
  Serial.println("ESC TEST PREP");
  
  // Do we even need these inits?
  pidController.Init(kP, kI, kD);
  pidControllerGantry.Init(kP_gantry, kI_gantry, kD_gantry);
  leftDrivePID.Init(kP, kI, kD);
  rightDrivePID.Init(kP, kI, kD);
  pidControllerExt.Init(kP_ext, kI_ext, kD_ext);

