GHP-63-ECE/ARCS/ARCS-ESP32/src/main.cpp
  // Turn off motors initially
  stopAllDriveMotors();

  // Set device as a Wi-Fi Station
  WiFi.mode(WIFI_STA);

  // Init ESP-NOW
  if (esp_now_init() != ESP_OK) {
    Serial.println("Error initializing ESP-NOW");
    return;
  }
  
  // Once ESPNow is successfully Init, we will register for recv CB to
  // get recv packer info
  esp_now_register_recv_cb(esp_now_recv_cb_t(OnDataRecv));
}

// MARK: Loop
long encoderStartLeft = 0;
long encoderStartRight = 0;
long encoderEndLeft = 0;
long encoderEndRight = 0;
float rpmLeft = 0.0;
float rpmRight = 0.0;
// int pwmValue = 255;

const int edfPowerMin = 1100;
const int edfPowerMax = 1900;
const int edfJoystickDefault = 1950;
int edfPower = edfPowerMin;
int edfIncrementResolution = 10;
int edfIncrement = 0;
int joystickDeadzone = 50;
bool killEverything = false;
bool joystickConnected = true;

void loop() {

  // followPath(ax, ay);
  // while(true){}
  // forwards();
  // homeGantryPosition();
  // driveToCrackCenter(0.5, 0.5);
  // gantryAlign(0.5);
  // crackAuto();
  // while (true){}
  // forwards();
  // turnDegrees(90, 200);
  // while (true) {}

  // setGantryPosition(maxGantryPosition/2, 255);
  // crackAuto();
  // while (true) {}
  // Serial.println("Gantry Position: " + String(encoderValueGantry));

  // setGantryPower(0);
  // delay(1000);

  // testAutoDrive();

  // MARK: Joystick Code
  
  
  int leftVal=map(joystickData.vy1, 0, 4095, -255, 255);
  int rightVal=map(joystickData.vy3, 0, 4095, -255, 255);
  int gantryVal=map(joystickData.vx2, 0, 4095, -255, 255);
  int extVal = map(joystickData.vy2, 0, 4095, -255, 255);
  
  if (abs(leftVal) < joystickDeadzone) {
    leftVal = 0;
  }
  if (abs(rightVal) < joystickDeadzone) {
    rightVal = 0;
  }
  if (abs(gantryVal) < joystickDeadzone) {
    gantryVal = 0;
  }
  if (abs(extVal) < joystickDeadzone) {
    extVal = 0;
  }
  bool button3State=joystickData.button3;
  bool button2State=joystickData.button2;
  bool button1State=joystickData.button1;
  bool button4State=joystickData.button4;
  bool button5State=joystickData.button5;

  edfIncrement = 0;
  if (joystickData.vy3 < edfJoystickDefault) {
    edfIncrement=map(joystickData.vy2, 0, edfJoystickDefault-200, -edfIncrementResolution, 0);
  } else {
    edfIncrement=map(joystickData.vy2, edfJoystickDefault+100, 4095, 0, edfIncrementResolution);
  }

  gantryVal = -gantryVal;

  edfIncrement = -edfIncrement;
  edfIncrement /= edfIncrementResolution; // Normalize to -1 to 1
  edfIncrement *= 3;
  if(button1State == 0){
    killEverything = false;
    // hasZeroedGantry = true;
    autonomous = false;
  } else if(button3State == 0){
    killEverything = true;
  }
  if (killEverything || !joystickConnected) {
    edfPower = edfPowerMin;
    servo.writeMicroseconds(edfPower); // output to edfs
    stopAllDriveMotors();
    analogWrite(ENI, 0);
    setExtruderPower(0);
  } else {
    if (button2State == 0) {
      edfPower += edfIncrement;
      edfPower = constrain(edfPower, edfPowerMin, edfPowerMax);
      servo.writeMicroseconds(edfPower); // output to edfs
    } 

    Serial.print("Setting Speed");
    setSpeed(leftVal, rightVal);
    setGantryPower(gantryVal);
    setExtruderPower(extVal);
  }
  
  Serial.print(" EDF Increment: ");
  Serial.print(edfIncrement);
  Serial.print(" EDF Power: ");
  Serial.print(edfPower);
  Serial.print(" Left Val: ");
  Serial.print(leftVal);
  Serial.print(" Right Val: ");
  Serial.print(rightVal);
  Serial.print(" Gantry Val: ");
  Serial.print(gantryVal);
  Serial.print(" Kill Everything: ");
  Serial.print(killEverything);
  Serial.println();
  
  
  
  // // Serial.println(encoderValueLeft + " hello " + encoderValueRight); // LINE OF DOOOOOOOOOOOOOOOOOOOMMMMMMMMMMM ONLY UNCOMMENT IN CASE OF EMERGENCY

  // // driveDistance(700, 255);

  // // Serial.print(String(encoderValueLeft));
  // // Serial.print(", ");
  // // Serial.print(String(encoderValueRight));
  // // Serial.print(", ");
  // // Serial.println(String(encoderValueGantry));

  // // digitalWrite(Gantry1, HIGH);
  // // digitalWrite(Gantry2, LOW);
  // // analogWrite(ENI, 100);

  // if (BS.available() > 0) {
  //   String rawData = Serial.readStringUntil('\n');
  //   rawData.trim();
  //   if (rawData.length() > 0) {
  //     int cxIndex = rawData.indexOf("cx");
  //     int cyIndex = rawData.indexOf("cy");
  //     int xIndex = rawData.indexOf("x1");
  //     String xData = rawData.substring(cxIndex + 4, cyIndex - cxIndex - 3);
  //     String yData = rawData.substring(cyIndex + 4, xIndex - cyIndex - 3);
  //     cx = xData.toFloat();
  //     cy = yData.toFloat();
  //   Serial.println(rawData);
  //   }
  // }
//   
if(button4State == LOW && prevButton4State == HIGH){
autonomous = true;
followPath(ax, ay);
autonomous = false;
button4State = prevButton4State;
}

if(button5State == LOW && prevButton5State == HIGH){
gantryAlign(cx);
button5State = prevButton5State;
}
  // Serial.print(String((ENCAFR)));
  // Serial.print(", ");
  // Serial.print(String(digitalRead(ENCBFR)));
  // Serial.print(", ");
  // Serial.print(String(digitalRead(ENCAFL)));
  // Serial.print(", ");
  // Serial.println(String(digitalRead(ENCBFL)));
}

 
